Revit 2024 API
FailureMessage.GetFailureDefinitionId Method
 Retrieves the id of the failure definition for the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailureDefinitionId GetFailureDefinitionId()
Visual Basic
Public Function GetFailureDefinitionId As FailureDefinitionId
Visual C++
public:
FailureDefinitionId^ GetFailureDefinitionId()
Return Value
 The id of the FailureDefinition for the failure.
See Also
FailureMessage Class
Autodesk.Revit.DB Namespace